; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v12 ?v9)
             (pred_6 ?v5 ?v11)
             (pred_12 ?v12 ?v11)
             (pred_3 ?v8 ?v12 )
	     (pred_10 ?v12)
             (pred_5 ?v13)
             (pred_11 ?v5)
             (pred_1 ?v11)
             (pred_2 ?v12)
             (pred_7 ?v5)
             (pred_8 ?v12)
             (pred_9 ))



(:action op_2
:parameters (?v6 ?v2 ?v1 ?v10)
:precondition (and (pred_5 ?v6) (pred_5 ?v2) (pred_11 ?v1) (pred_1 ?v10)
          (pred_4 ?v6 ?v2) (pred_6 ?v1 ?v10)
                   (pred_12 ?v2 ?v10) (pred_10 ?v6) 
                   (pred_2 ?v2) (pred_7 ?v1))
:effect (and  (pred_8 ?v2) (not (pred_2 ?v2))))


(:action op_3
:parameters (?v6 ?v3)
:precondition (and (pred_5 ?v6) (pred_5 ?v3)
               (pred_10 ?v6) (pred_4 ?v6 ?v3) (pred_8 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v6))))

(:action op_4
:parameters (?v6 ?v1)
:precondition (and (pred_5 ?v6) (pred_11 ?v1) 
                  (pred_10 ?v6) (pred_3 ?v1 ?v6) (pred_9 ))
:effect (and (pred_7 ?v1)
   (not (pred_3 ?v1 ?v6)) (not (pred_9 ))))


(:action op_1
:parameters (?v6 ?v7 ?v4)
:precondition (and (pred_5 ?v6) (pred_11 ?v7) (pred_11 ?v4)
                  (pred_10 ?v6) (pred_7 ?v4) (pred_3 ?v7 ?v6))
:effect (and (pred_7 ?v7) (pred_3 ?v4 ?v6)
        (not (pred_7 ?v4)) (not (pred_3 ?v7 ?v6))))

(:action op_5
:parameters (?v6 ?v1)
:precondition (and (pred_5 ?v6) (pred_11 ?v1) 
                  (pred_10 ?v6) (pred_7 ?v1))
:effect (and (pred_9 ) (pred_3 ?v1 ?v6) (not (pred_7 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_08 obj_06 obj_14 obj_13 obj_20 obj_11 obj_03 obj_19 obj_17 obj_16 obj_09 obj_12 obj_18 obj_10 obj_02 obj_01
    obj_07 obj_15
    obj_04 obj_05
    )

    (:init
       (pred_9)

       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_13)
       (pred_5 obj_20)
       (pred_5 obj_11)
       (pred_5 obj_03)
       (pred_5 obj_19)
       (pred_5 obj_17)
       (pred_5 obj_16)
       (pred_5 obj_09)
       (pred_5 obj_12)
       (pred_5 obj_18)
       (pred_5 obj_10)
       (pred_5 obj_02)
       (pred_5 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_15)
       (pred_11 obj_04)
       (pred_11 obj_05)

       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_06)
       (pred_4 obj_06 obj_11)
       (pred_4 obj_06 obj_14)
       (pred_4 obj_06 obj_08)
       (pred_4 obj_14 obj_03)
       (pred_4 obj_14 obj_13)
       (pred_4 obj_14 obj_06)
       (pred_4 obj_13 obj_19)
       (pred_4 obj_13 obj_14)
       (pred_4 obj_20 obj_17)
       (pred_4 obj_20 obj_11)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_11 obj_16)
       (pred_4 obj_11 obj_03)
       (pred_4 obj_11 obj_06)
       (pred_4 obj_11 obj_20)
       (pred_4 obj_03 obj_09)
       (pred_4 obj_03 obj_19)
       (pred_4 obj_03 obj_14)
       (pred_4 obj_03 obj_11)
       (pred_4 obj_19 obj_12)
       (pred_4 obj_19 obj_13)
       (pred_4 obj_19 obj_03)
       (pred_4 obj_17 obj_18)
       (pred_4 obj_17 obj_16)
       (pred_4 obj_17 obj_20)
       (pred_4 obj_16 obj_10)
       (pred_4 obj_16 obj_09)
       (pred_4 obj_16 obj_11)
       (pred_4 obj_16 obj_17)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_09 obj_03)
       (pred_4 obj_09 obj_16)
       (pred_4 obj_12 obj_01)
       (pred_4 obj_12 obj_19)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_18 obj_10)
       (pred_4 obj_18 obj_17)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_10 obj_16)
       (pred_4 obj_10 obj_18)
       (pred_4 obj_02 obj_01)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_01 obj_12)
       (pred_4 obj_01 obj_02)
       (pred_2 obj_10)
       (pred_2 obj_14)
       (pred_12  obj_10 obj_07)
       (pred_12  obj_14 obj_15)
       (pred_8 obj_08)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_20)
       (pred_8 obj_11)
       (pred_8 obj_03)
       (pred_8 obj_19)
       (pred_8 obj_17)
       (pred_8 obj_16)
       (pred_8 obj_09)
       (pred_8 obj_12)
       (pred_8 obj_18)
       (pred_8 obj_02)
       (pred_8 obj_01)

       (pred_6  obj_04 obj_07)
       (pred_6  obj_05 obj_15)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_05 obj_19)
       (pred_10 obj_12)
    )

    (:goal (and
       (pred_3 obj_04 obj_06)
       (pred_3 obj_05 obj_18)
    ))
(:constraints
  (always (not (pred_10 obj_14)))
)
)

; plan
1. (op_3 obj_12 obj_09)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_09)
   goals met: 0 of 2
2. (op_3 obj_09 obj_16)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_16)
   goals met: 0 of 2
3. (op_3 obj_16 obj_11)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_11)
   goals met: 0 of 2
4. (op_3 obj_11 obj_03)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_03)
   goals met: 0 of 2
5. (op_3 obj_03 obj_19)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_19)
   goals met: 0 of 2
6. (op_4 obj_19 obj_05)
   deleted: (pred_3 obj_05 obj_19) (pred_9)
   added: (pred_7 obj_05)
   goals met: 0 of 2
7. (op_3 obj_19 obj_03)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_03)
   goals met: 0 of 2
8. (op_5 obj_03 obj_05)
   deleted: (pred_7 obj_05)
   added: (pred_9) (pred_3 obj_05 obj_03)
   goals met: 0 of 2
9. (op_3 obj_03 obj_19)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_19)
   goals met: 0 of 2
10. (op_3 obj_19 obj_13)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_13)
   goals met: 0 of 2
11. (op_4 obj_13 obj_04)
   deleted: (pred_3 obj_04 obj_13) (pred_9)
   added: (pred_7 obj_04)
   goals met: 0 of 2
12. (op_3 obj_13 obj_19)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_19)
   goals met: 0 of 2
13. (op_3 obj_19 obj_03)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_03)
   goals met: 0 of 2
14. (op_3 obj_03 obj_11)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_11)
   goals met: 0 of 2
15. (op_3 obj_11 obj_06)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_06)
   goals met: 0 of 2
16. (op_5 obj_06 obj_04)
   deleted: (pred_7 obj_04)
   added: (pred_9) (pred_3 obj_04 obj_06)
   goals met: 1 of 2
17. (op_3 obj_06 obj_11)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_11)
   goals met: 1 of 2
18. (op_3 obj_11 obj_03)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_03)
   goals met: 1 of 2
19. (op_4 obj_03 obj_05)
   deleted: (pred_3 obj_05 obj_03) (pred_9)
   added: (pred_7 obj_05)
   goals met: 1 of 2
20. (op_3 obj_03 obj_11)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_11)
   goals met: 1 of 2
21. (op_3 obj_11 obj_20)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_20)
   goals met: 1 of 2
22. (op_3 obj_20 obj_17)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_17)
   goals met: 1 of 2
23. (op_3 obj_17 obj_18)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_18)
   goals met: 1 of 2
24. (op_5 obj_18 obj_05)
   deleted: (pred_7 obj_05)
   added: (pred_9) (pred_3 obj_05 obj_18)
   goals met: 2 of 2
